<a href="https://colab.research.google.com/github/lpean/MonProjetPython_Velo/blob/master/EtudeVelo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import pandas as pd 
url = 'https://raw.githubusercontent.com/lpean/MonProjetPython_Velo/master/velo.csv'

df = pd.read_csv(url, sep=';', verbose = 'true', dayfirst='True') 
df.shape

Tokenization took: 3.57 ms
Type conversion took: 7.13 ms
Parser memory cleanup took: 0.01 ms

(10886, 13)

In [17]:
# Visualisation des 3 premières lignes
df.head(n=3)

           datetime  season  holiday  ...  registered  count  test
0  01/01/2011 00:00       1        0  ...          13     16  VRAI
1  01/01/2011 01:00       1        0  ...          32     40  VRAI
2  01/01/2011 02:00       1        0  ...          27     32  VRAI

[3 rows x 13 columns]

In [18]:
# Pour se rassurer visualisation des 3 dernières lignes
df.tail(n=3)

               datetime  season  holiday  ...  registered  count  test
10883  19/12/2012 21:00       4        0  ...         164    168  VRAI
10884  19/12/2012 22:00       4        0  ...         117    129  VRAI
10885  19/12/2012 23:00       4        0  ...          84     88  VRAI

[3 rows x 13 columns]

In [19]:
# OK il semblerait que les données soient triées par datetime
df.info()
# On voit que Data time est mal typée (c'est un objet)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 13 columns):
datetime      10886 non-null object
season        10886 non-null int64
holiday       10886 non-null int64
workingday    10886 non-null int64
weather       10886 non-null int64
temp          10886 non-null float64
atemp         10886 non-null float64
humidity      10886 non-null int64
windspeed     10886 non-null float64
casual        10886 non-null int64
registered    10886 non-null int64
count         10886 non-null int64
test          10886 non-null object
dtypes: float64(3), int64(8), object(2)
memory usage: 1.1+ MB

In [45]:
Madate = df['datetime']
test = pd.to_datetime(Madate)
test

10885   2012-12-19 23:00:00
10884   2012-12-19 22:00:00
10883   2012-12-19 21:00:00
10882   2012-12-19 20:00:00
10881   2012-12-19 19:00:00
                ...
4       2011-01-01 04:00:00
3       2011-01-01 03:00:00
2       2011-01-01 02:00:00
1       2011-01-01 01:00:00
0       2011-01-01 00:00:00
Name: datetime, Length: 10886, dtype: datetime64[ns]

In [55]:
df.drop('test', axis=1, inplace=True)
df.shape
df.head(3)

               datetime  season  holiday  ...  casual  registered  count
10885  19/12/2012 23:00       4        0  ...       4          84     88
10884  19/12/2012 22:00       4        0  ...      12         117    129
10883  19/12/2012 21:00       4        0  ...       4         164    168

[3 rows x 12 columns]

In [56]:
df.shape

(10886, 12)

In [23]:
#Verification que datetime est bien un identifiant
print("Verification identifiant" , df["datetime"].value_counts().max)

Verification identifiant <bound method Series.max of 01/05/2011 11:00    1
07/04/2011 19:00    1
12/08/2011 02:00    1
14/06/2012 01:00    1
18/04/2011 17:00    1
                   ..
01/02/2011 23:00    1
03/06/2011 04:00    1
04/04/2012 00:00    1
08/01/2011 05:00    1
18/03/2012 10:00    1
Name: datetime, Length: 10886, dtype: int64>

In [36]:
df.sort_values(by = ['datetime'], inplace= True, ascending = True)
df.head(3)

           datetime  season  holiday  ...  registered  count  test
0  01/01/2011 00:00       1        0  ...          13     16  VRAI
1  01/01/2011 01:00       1        0  ...          32     40  VRAI
2  01/01/2011 02:00       1        0  ...          27     32  VRAI

[3 rows x 13 columns]

In [39]:
df.sort_values(by = ['datetime'], inplace = True, ascending =False)
df.head(3)

               datetime  season  holiday  ...  registered  count  test
10885  19/12/2012 23:00       4        0  ...          84     88  VRAI
10884  19/12/2012 22:00       4        0  ...         117    129  VRAI
10883  19/12/2012 21:00       4        0  ...         164    168  VRAI

[3 rows x 13 columns]

In [35]:
df.sort_values(by = ['season'], inplace=True, ascending = False)
df.head(3)

               datetime  season  holiday  ...  registered  count  test
10885  19/12/2012 23:00       4        0  ...          84     88  VRAI
9523   01/10/2012 04:00       4        0  ...          10     10  VRAI
9540   01/10/2012 21:00       4        0  ...         205    218  VRAI

[3 rows x 13 columns]

In [40]:
#Description rapide des données sur les variables quantitatives
df.describe()
# Ca renvoie n'importe quoi pour les variables catégorielles car la méthode Pandas.read_csv() a mal inféré certains type de données

             season       holiday  ...    registered         count
count  10886.000000  10886.000000  ...  10886.000000  10886.000000
mean       2.506614      0.028569  ...    155.552177    191.574132
std        1.116174      0.166599  ...    151.039033    181.144454
min        1.000000      0.000000  ...      0.000000      1.000000
25%        2.000000      0.000000  ...     36.000000     42.000000
50%        3.000000      0.000000  ...    118.000000    145.000000
75%        4.000000      0.000000  ...    222.000000    284.000000
max        4.000000      1.000000  ...    886.000000    977.000000

[8 rows x 11 columns]

In [0]:
#from dataloader import Dataloader
import seaborn as sns
import matplotlib.pyplot as plt
from prettytable import PrettyTable
import numpy as np
# Sklearn model delection
from sklearn.model_selection import RandomizedSearchCV
# Sklearn metrics
from sklearn.metrics import mean_squared_error, mean_squared_log_error
# Sklearn models
from sklearn.linear_model import Lasso, ElasticNet, Ridge, SGDRegressor
from sklearn.svm import SVR, NuSVR
from sklearn.ensemble import BaggingRegressor, RandomForestRegressor
from sklearn.neighbors import KNeighborsClassifier
from sklearn.cluster import KMeans

from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier

from sklearn.linear_model import LinearRegression

%matplotlib inline